In [1]:
import pandas as pd
import pymongo

In [2]:
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)

# Declare the database
db = client.us_income_in_us_db

# Declare the collection
collection = db.us_income_in_us_db

# Extract

## Our original sources came as CSV files from Kaggle. We found sources that had the median incomes for the United States and the other one had locations of Starbucks' in the world.

In [3]:
csv_file = "Resources/starbucks.csv"
starbucks_df = pd.read_csv(csv_file)
starbucks_df.head()

,Brand,Store Number,Store Name,Ownership Type,Street Address,City,State/Province,Country,Postcode,Phone Number,Timezone,Longitude,Latitude
0,Starbucks,47370-257954,"Meritxell, 96",Licensed,"Av. Meritxell, 96",Andorra la Vella,7,AD,AD500,376818720,GMT+1:00 Europe/Andorra,1.53,42.51
1,Starbucks,22331-212325,Ajman Drive Thru,Licensed,"1 Street 69, Al Jarf",Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.42
2,Starbucks,47089-256771,Dana Mall,Licensed,Sheikh Khalifa Bin Zayed St.,Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.39
3,Starbucks,22126-218024,Twofour 54,Licensed,Al Salam Street,Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.38,24.48
4,Starbucks,17127-178586,Al Ain Tower,Licensed,"Khaldiya Area, Abu Dhabi Island",Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.54,24.51

# Transform

## We took out just a few columns from the Starbuck location data to narrow it down, renamed them, and set the index as the store number. Then we filted out just the results in the United States.

In [4]:
# Create a filtered dataframe from specific columns
starbucks_cols = ["Store Number", "Store Name", "City", "State/Province", "Country"]
starbucks_transformed= starbucks_df[starbucks_cols].copy()

# Rename the column headers
starbucks_transformed = starbucks_transformed.rename(columns={"Store Number": "id",
                                                          "Store Name": "Store_name",
                                                          "State/Province": "State"})

# Clean the data by dropping duplicates and setting the index
starbucks_transformed.drop_duplicates("id", inplace=True)
starbucks_transformed.set_index("id", inplace=True)

In [5]:
columns = [
     "Store_name", "City", "State", "Country"]


starbucks_in_us = starbucks_transformed.loc[starbucks_transformed["Country"] == "US",  columns]
starbucks_in_us = starbucks_in_us.dropna()
starbucks_in_us

                                    Store_name          City State Country
id
3513-125945            Safeway-Anchorage #1809     Anchorage    AK      US
74352-84449            Safeway-Anchorage #2628     Anchorage    AK      US
12449-152385         Safeway - Anchorage #1813     Anchorage    AK      US
24936-233524          100th & C St - Anchorage     Anchorage    AK      US
8973-85630                Old Seward & Diamond     Anchorage    AK      US
...                                        ...           ...   ...     ...
74385-87621              Safeway-Laramie #2466       Laramie    WY      US
73320-24375           Ridley's - Laramie #1131       Laramie    WY      US
22425-219024            Laramie - Grand & 30th       Laramie    WY      US
10849-103163      I-80 & Dewar Dr-Rock Springs  Rock Springs    WY      US
10769-102454  Coffeen & Brundage Lane-Sheridan     Sheridian    WY      US

[13608 rows x 4 columns]

## From there we decided to change the index to the State instead.  This allowed us to get the count of the Starbucks stores by state so that we could have an even comparison to the state column from the US income file.

In [6]:
starbucks_in_us.set_index("State", inplace=True)

In [7]:
starCount = starbucks_in_us.groupby("State").count()

starCount = starCount.drop(columns=["Country"])
starCount = starCount.rename(columns={"Store_name": "Starbucks Count"})
starCount

       Starbucks Count  City
State
AK                  49    49
AL                  85    85
AR                  55    55
AZ                 488   488
CA                2821  2821
CO                 481   481
CT                 123   123
DC                  91    91
DE                  25    25
FL                 694   694
GA                 326   326
HI                  99    99
IA                  89    89
ID                  67    67
IL                 575   575
IN                 221   221
KS                  94    94
KY                 116   116
LA                  84    84
MA                 273   273
MD                 257   257
ME                  30    30
MI                 283   283
MN                 184   184
MO                 188   188
MS                  32    32
MT                  36    36
NC                 338   338
ND                  13    13
NE                  58    58
NH                  29    29
NJ                 261   261
NM                  76    76
NV                 253   253
NY                 645   645
OH                 378   378
OK                  79    79
OR                 359   359
PA                 357   357
RI                  27    27
SC                 131   131
SD                  25    25
TN                 180   180
TX                1042  1042
UT                 101   101
VA                 432   432
VT                   8     8
WA                 757   757
WI                 145   145
WV                  25    25
WY                  23    23

## We imported the US Median income csv and filted it down to a few necessary columns and renamed them to names that were easier to use.  We grouped it by state and then found the Median of the median incomes for each state.

In [8]:
csv_file2 = "Resources/us_income.csv"
us_income_df = pd.read_csv(csv_file2, encoding = "ISO-8859-1")
us_income_df.head()

,id,State_Code,State_Name,State_ab,County,City,Place,Type,Primary,Zip_Code,Area_Code,ALand,AWater,Lat,Lon,Mean,Median,Stdev,sum_w
0,1011000,1,Alabama,AL,Mobile County,Chickasaw,Chickasaw city,City,place,36611,251,10894952,909156,30.771450,-88.079697,38773,30506,33101,1638.260513
1,1011010,1,Alabama,AL,Barbour County,Louisville,Clio city,City,place,36048,334,26070325,23254,31.708516,-85.611039,37725,19528,43789,258.017685
2,1011020,1,Alabama,AL,Shelby County,Columbiana,Columbiana city,City,place,35051,205,44835274,261034,33.191452,-86.615618,54606,31930,57348,926.031000
3,1011030,1,Alabama,AL,Mobile County,Satsuma,Creola city,City,place,36572,251,36878729,2374530,30.874343,-88.009442,63919,52814,47707,378.114619
4,1011040,1,Alabama,AL,Mobile County,Dauphin Island,Dauphin Island,Town,place,36528,251,16204185,413605152,30.250913,-88.171268,77948,67225,54270,282.320328

In [9]:
# Create a filtered dataframe from specific columns
us_income_cols = ["id", "State_ab", "City", "Type", "Median"]
us_income_transformed= us_income_df[us_income_cols].copy()

# Rename the column headers
us_income_transformed = us_income_transformed.rename(columns={"State_ab": "State",
                                                              "Type": "State_type"})

# Clean the data by dropping duplicates and setting the index
us_income_transformed.drop_duplicates("id", inplace=True)
us_income_transformed.set_index("id", inplace=True)

In [10]:
meanMedian = us_income_transformed.groupby(us_income_transformed["State"]).median()
meanMedian

        Median
State
AK     70536.0
AL     39943.0
AR     37758.0
AZ     47784.0
CA     63367.5
CO     61376.0
CT     79391.0
DC     73188.0
DE     58866.5
FL     46897.0
GA     43583.5
HI     69637.0
IA     52733.0
ID     44913.0
IL     54956.0
IN     48809.5
KS     49228.0
KY     40216.0
LA     41026.0
MA     73855.0
MD     77456.5
ME     46579.0
MI     46552.0
MN     56398.0
MO     42974.0
MS     35766.0
MT     47384.0
NC     43260.0
ND     55304.0
NE     50630.0
NH     66794.0
NJ     81550.5
NM     45854.0
NV     53036.0
NY     61173.5
OH     46929.0
OK     41469.0
OR     52051.0
PA     51143.0
PR     17895.5
RI     63928.0
SC     42596.0
SD     46947.5
TN     41694.5
TX     50903.5
UT     63692.0
VA     63318.0
VT     53926.0
WA     63196.0
WI     54200.5
WV     38718.5
WY     69165.0

## Finally we merged the two DataFrames on the state column, leaving us with a table that shows how many Starbucks are in each state and the Median median income of that state.

In [11]:
Combined = pd.merge(starCount, meanMedian, how ="outer", on ="State")
Combined = Combined.dropna()
Combined = Combined.drop(columns="City")
Combined["Starbucks Count"] = Combined["Starbucks Count"].map('{:.0f}'.format)
Combined["Median"] = Combined["Median"].map('${:,.2f}'.format)
Combined

      Starbucks Count      Median
State
AK                 49  $70,536.00
AL                 85  $39,943.00
AR                 55  $37,758.00
AZ                488  $47,784.00
CA               2821  $63,367.50
CO                481  $61,376.00
CT                123  $79,391.00
DC                 91  $73,188.00
DE                 25  $58,866.50
FL                694  $46,897.00
GA                326  $43,583.50
HI                 99  $69,637.00
IA                 89  $52,733.00
ID                 67  $44,913.00
IL                575  $54,956.00
IN                221  $48,809.50
KS                 94  $49,228.00
KY                116  $40,216.00
LA                 84  $41,026.00
MA                273  $73,855.00
MD                257  $77,456.50
ME                 30  $46,579.00
MI                283  $46,552.00
MN                184  $56,398.00
MO                188  $42,974.00
MS                 32  $35,766.00
MT                 36  $47,384.00
NC                338  $43,260.00
ND                 13  $55,304.00
NE                 58  $50,630.00
NH                 29  $66,794.00
NJ                261  $81,550.50
NM                 76  $45,854.00
NV                253  $53,036.00
NY                645  $61,173.50
OH                378  $46,929.00
OK                 79  $41,469.00
OR                359  $52,051.00
PA                357  $51,143.00
RI                 27  $63,928.00
SC                131  $42,596.00
SD                 25  $46,947.50
TN                180  $41,694.50
TX               1042  $50,903.50
UT                101  $63,692.00
VA                432  $63,318.00
VT                  8  $53,926.00
WA                757  $63,196.00
WI                145  $54,200.50
WV                 25  $38,718.50
WY                 23  $69,165.00

# Load

## We chose to load it into a mongo database since it's easier to use becuase you don't have to create the tables ahead of time, they can just be created when the information is loaded into them.

In [12]:
# Insert the document into the database
# The database and collection, if they don't already exist, will be created at this point.
db.collection.insert_many(Combined.to_dict('records'))